mountaineer_billing/__tests__/fixtures/stripe_flows/subscription/4_checkout.session.completed.json

{
    "id": "evt_1RPsA7RGAudMahWR0HOX9afN",
    "object": "event",
    "api_version": "2025-04-30.basil",
    "created": 1747516855,
    "data": {
        "object": {
            "id": "cs_test_a1vyFJx0Bgx3qy9emunBPJ1NNQ7c3JKIKDpifnaim6nzbSf5dTmeggd4HA",
            "object": "checkout.session",
            "adaptive_pricing": null,
            "after_expiration": null,
            "allow_promotion_codes": null,
            "amount_subtotal": 1500,
            "amount_total": 1500,
            "automatic_tax": {
                "enabled": false,
                "liability": null,
                "provider": null,
                "status": null
            },
            "billing_address_collection": null,
            "cancel_url": "http://127.0.0.1:5084/cancel",
            "client_reference_id": null,
            "client_secret": null,
            "collected_information": {
                "shipping_details": null
            },
            "consent": null,
            "consent_collection": null,
            "created": 1747516836,
            "currency": "usd",
            "currency_conversion": null,
            "custom_fields": [],
            "custom_text": {
                "after_submit": null,
                "shipping_address": null,
                "submit": null,
                "terms_of_service_acceptance": null
            },
            "customer": "cus_SKXENLZtmfAcAK",
            "customer_creation": "always",
            "customer_details": {
                "address": {
                    "city": null,
                    "country": "US",
                    "line1": null,
                    "line2": null,
                    "postal_code": "94949",
                    "state": null
                },
                "email": "piercefreeman@gmail.com",
                "name": "Pierce Freeman",
                "phone": null,
                "tax_exempt": "none",
                "tax_ids": []
            },
            "customer_email": null,
            "discounts": [],
            "expires_at": 1747603236,
            "invoice": "in_1RPsA6RGAudMahWRQIMSBaSM",
            "invoice_creation": null,
            "livemode": false,
            "locale": null,
            "metadata": {},
            "mode": "subscription",
            "payment_intent": null,
            "payment_link": null,
            "payment_method_collection": "always",
            "payment_method_configuration_details": null,
            "payment_method_options": {
                "card": {
                    "request_three_d_secure": "automatic"
                }
            },
            "payment_method_types": [
                "card"
            ],
            "payment_status": "paid",
            "permissions": null,
            "phone_number_collection": {
                "enabled": false
            },
            "recovered_from": null,
            "saved_payment_method_options": {
                "allow_redisplay_filters": [
                    "always"
                ],
                "payment_method_remove": "disabled",
                "payment_method_save": null
            },
            "setup_intent": null,
            "shipping_address_collection": null,
            "shipping_cost": null,
            "shipping_options": [],
            "status": "complete",
            "submit_type": null,
            "subscription": "sub_1RPsA6RGAudMahWRowPFCtUQ",
            "success_url": "http://127.0.0.1:5084/success",
            "total_details": {
                "amount_discount": 0,
                "amount_shipping": 0,
                "amount_tax": 0
            },
            "ui_mode": "hosted",
            "url": null,
            "wallet_options": null
        }
    },
    "livemode": false,
    "pending_webhooks": 2,
    "request": {
        "id": null,
        "idempotency_key": null
    },
    "type": "checkout.session.completed"
}